package org.buaa.nlp.cj.codingInterviewGuide._09_16;

/**
 * 题目一
 有一个机器按自然数序列的方式吐出球(1 号球,2 号球,3 号球,......)，
 你有一个袋子，袋子最多只能装下K个球，并且除袋子以外，你没有更多的空间。
 设计一种选择方式，使得当机器吐出第N号球的时候(N>K)，你袋子中的球数是K个，
 同时可以保证从1号球到N号球中的每一个，被选进袋子的概率都是K/N。举一个更具体的例子。
 有一个只能装下10个球的袋子，当吐出100个球时，袋子里有10个球，
 并且1~100号中的每一个球被选中的概率都是10/100。然后继续吐球，当吐出1000个球时，
 袋子里有10个球，并且1~1000号中的每一个球被选中的概率都是10/1000。继续吐球，当吐出i个球时，
 袋子里有10个球，并且1~i号中的每一个球被选中的概率都是10/i，即吐球的同时，
 已经吐出的球被选中的概率也动态地变化。
 * Created by whisky-yonk on 10/11/2015.
 */
public class _01_ {
}
